In [26]:
import pandas as pd

tbl0 = pd.read_csv("tbl0.tsv", sep="\t")
tbl1 = pd.read_csv("tbl1.tsv", sep="\t")
tbl2 = pd.read_csv("tbl2.tsv", sep="\t")

In [27]:
tbl0.head()

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28
2    2   B    5  1998-05-02
3    3   A    3  1999-08-28
4    4   C    6  1999-12-01

In [28]:
tbl2.head()

   _c0 _c5a  _c5b
0    0  jjj     3
1    0  bbb     0
2    0  ddd     9
3    0  ggg     8
4    0  hhh     2

In [29]:
tbl0.merge(tbl2, on='_c0').groupby('_c1')['_c5b'].sum()

_c1
A    146
B    134
C     81
D    112
E    275
Name: _c5b, dtype: int64